<script lang="ts">
	import ext from "$lib/ext";
</script>

<main class="page">
	<h1 class="page-title mb-10">กฎการแข่งขัน Pre TOI19</h1>

	<ul class="rwidth mx-auto list-disc pl-8 pr-4 text-left lg:px-0">
		<li>การแข่งขันจะจัดขึ้นในวันที่ xx และ xx พฤษภาคม 2566 ในเวลา 19:00 - 22:00</li>
		<li>ในแต่ละวัน จะมีโจทย์วันละ 3 ข้อ แต่ละข้อมีคะแนนเท่ากันที่ 100 คะแนน</li>
		<li>
			เนื้อหาโจทย์จะออกตามเนื้อหาที่ออกสอบในการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ (TOI)
			<a class="blue-link" href="https://toi19.nu.ac.th/scope.php" {...ext}>
				ขอบเขตเนื้อหาของ TOI19
			</a>
		</li>
		<li>
			การให้คะแนนในการแข่งขันครั้งนี้ ใช้วิธีเดียวกับการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติครั้งที่
			19 (TOI19) นั่นคือผลรวมของคะแนนในแต่ละปัญหาย่อยที่ดีที่สุดจากทุกการส่ง แนะนำให้ผู้เข้าแข่งขัน
			TOI19 อ่าน
			<a class="blue-link" href="https://toi19.nu.ac.th/criterion.php" {...ext}>
				เกณฑ์การให้คะแนนของ TOI19
			</a>
			เพื่อทราบอีกรูปแบบของการให้คะแนน
		</li>
		<li>
			ขอความร่วมมือผู้เข้าแข่งขันทำโจทย์ด้วยตนเอง ไม่กระทำการทุจริต เพื่อความสนุกของการแข่งขัน
		</li>
		<li>
			อาจจะมีการเพิ่มชุดทดสอบระหว่างสอบหรือหลังสอบ
			ในกรณีระหว่างสอบทางการแข่งขันรับประกันว่าจะไม่มีการเพิ่มชุดทดสอบในชั่วโมงสุดท้ายของการแข่งขัน
			ในกรณีที่เพิ่มหลังการสอบ การแข่งขันรับประกันว่าคะแนนของคุณจะไม่หายเกิน 50%
		</li>
	</ul>
</main>

<style lang="postcss">
	li {
		@apply my-2 text-xl xl:text-2xl;
	}
</style>
